# Business Intelligence (WI-201) / 2023
#### Prof. Dr. Sebastian Fischer

## Übungsblatt 2: OLAP

> *Durch die Bearbeitung dieses Übungsblattes werden die Lerninhalte der Lerneinheit 2 praktisch angewendet und gefestigt. Durch pünktliche Abgabe eines vollständigen Übungsblattes werden Punkte auf die Gesamtbewertung erzielt. Das Übungsblatt ist eine Individualleistung. Gleichzeitig darf mit maximal zwei weiteren Studierenden gemeinsam die eigene Lösung besprochen werden. Sollte eine Lösung Elemente von anderen Studierenden oder Quellen beinhalten, die nicht als solche gekennzeichnet wurden, wird das Übungsblatt für alle Beteiligten mit 0 Punkten bewertet.*

In [6]:
from hilfsfunktionen import *
import pandas as pd
import numpy as np
from IPython.display import display_html
from sqlalchemy import create_engine, text
import mysql.connector
from mysql.connector import errorcode
import pymysql

## Aufgabe 1: 
**OLAP orientierte Analyse direkt aus dem Star-Schema (Übungsblatt 1) mit SQL**

Wir wollen nun unser in Übungsblatt 1 erstelltes Star-Schema erneut mit SQL abfragen, um die folgenden 3 unternehmensrelevanten Fragestellungen zu beantworten

>1. Wie viel Gewinn haben die Filialen in Deutschland im Monat März gemacht?
>2. Welche Produktkategorien haben in welchen Ländern einen Verlust (negativer Gewinn) eingebracht?
>3. Denke dir eine weitere OLAP-Analyse aus. Oder nimm diese hier: Von welchen Herstellern wurde insgesamt wie viel umgesetzt?

In [7]:
mysql_usr = "Katherine" # mit eurem Nutzer ersetzen
mysql_pw = "root" # mit eurem Passwort ersetzen

connection = create_server_connection("localhost", mysql_usr, mysql_pw)
# Falls bereits eine Datenbank namens "OLAP_DB" existiert, wird sie mit diesem Befehl gelöscht:
create_database_query = "DROP DATABASE IF EXISTS OLAP_DB;"
create_database(connection, create_database_query)

# Erstellen der Datenbank "OLAP_DB"
create_database_query = "CREATE DATABASE OLAP_DB;"
create_database(connection, create_database_query)

# Befüllen der OLAP_DB mit Daten aus bereitgestelltem SQL script
file = open("data/db/OLAP_DB_schema+data.sql", 'r')
olap_db_sql_script_string = file.read()
file.close()
connection = create_db_connection("localhost", mysql_usr, mysql_pw, "OLAP_DB")
execute_query(connection, olap_db_sql_script_string)

MySQL Database connection successful
Database created successfully
Database created successfully
MySQL Database connection successful
Query successful

In [8]:
connection = create_server_connection("localhost", mysql_usr, mysql_pw)
create_database(connection, "DROP DATABASE IF EXISTS OLTP_DB;")
create_database(connection, "CREATE DATABASE OLTP_DB;")

MySQL Database connection successful
Database created successfully
Database created successfully
MySQL Database connection successful
result: []
Query successful

### Beispiel

In [22]:
db_connection = pymysql.connect(host='localhost',
                                user=mysql_usr,
                                password=mysql_pw,
                                db='OLTP_DB')
query = '''SELECT Faktentabelle_Marketing_Vertrieb.`Umsatz Ist`, \
                                            Faktentabelle_Marketing_Vertrieb.`Umsatz Soll`, \
                                            Standortestammdaten.LandBez, \
                                            Faktentabelle_Marketing_Vertrieb.Waehrung FROM \
                                                 Standortestammdaten JOIN Faktentabelle_Marketing_Vertrieb \
                                                     ON Standortestammdaten.FilialeID = Faktentabelle_Marketing_Vertrieb.FilialeID'''
df_umsaetze_land_waehrung = pd.read_sql('select * from OLAP_DB.produktstamm', con=db_connection)

# df_umsaetze_land_waehrung = df_umsaetze_land_waehrung[df_umsaetze_land_waehrung["Umsatz Ist"] > 0].groupby(["Waehrung", "LandBez"]).sum().round(1)

df_umsaetze_land_waehrung

C:\Users\kuhle\AppData\Local\Temp\ipykernel_1288\2621699765.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_umsaetze_land_waehrung = pd.read_sql('select * from OLAP_DB.produktstamm', con=db_connection)

,ProduktID,Produktkategorie,Hersteller,Einheit,Herstellkosten je Einheit in EUR,Kurztext,Langtext
0,1,Tablet PC,Acer,ST,1189,Acer TM C104TCi Tablet PC,900-MHz PIII-M 256 MB RAM 40 GB Hard Drive
1,2,Notebook,Acer,ST,851,Acer TravelMate 233XV Notebook,20-GHz Celeron-M 256 MB RAM 30 GB Hard Drive D...
2,3,Notebook,Acer,ST,1679,Acer TravelMate 281XV Notebook,180-GHz Pentium 4-M 256 MB RAM 30 GB Hard Driv...
3,4,Notebook,Acer,ST,781,Acer TravelMate TM233XVi Notebook PC,20-GHz Celeron-M 256 MB RAM 30 GB Hard Drive
4,5,Notebook,Acer,ST,977,Acer TravelMate TM234LCi Notebook PC,22-GHz Celeron-M 512 MB RAM 40 GB Hard Drive
...,...,...,...,...,...,...,...
94,95,Tablet,Sony,ST,91,Sony Clie PEG-SJ20 Handheld,No Description
95,96,Tablet,Sony,ST,140,Sony Clie PEG-SJ22 Handheld,No Description
96,97,Tablet,Sony,ST,280,Sony Clie PEG-SJ33/UL Handheld - Blue,No Description
97,98,Tablet,Sony,ST,196,Sony CLIE PEG-T615C/S Handheld (Silver),No Description
98,99,Tablet,Sony,ST,244,Sony CLIE PEG-T665C/U Handheld,No Description

### Aufgabe 1.1

In [5]:
# Wie viel Gewinn haben die Filialen in Deutschland im Monat März gemacht?

# INSERT CODE HERE

                                                                Gewinn
LandBez     Monat Filiale-Bez
Deutschland März  Global Computer Suppliers-Berlin          1226575.56
                  Global Computer Suppliers-Frankfurt a.M.  1340588.80
                  Global Computer Suppliers-München         1421986.22
                  Global Computer Suppliers-Stuttgart       1637243.83

### Aufgabe 1.2

In [6]:
# Welche Produktkategorien haben in welchen Ländern einen Verlust (negativer Gewinn) eingebracht?

# INSERT CODE HERE

                                    Gewinn
LandBez        Produktkategorie
Großbritannien Tablet            -39642.25
               Tablet PC        -651972.42

### Aufgabe 1.3

In [7]:
# Wenn dir keine eigene Fragestellung einfällt, könntest du diese nehmen:
# Von welchen Herstellern wurde insgesamt wie viel umgesetzt?

# INSERT CODE HERE

              Umsatz Ist
Hersteller
Acer        1.417372e+08
Apple       2.254569e+08
Casio       1.105199e+07
Compaq      1.633178e+08
HP          1.378464e+08
IBM         8.468053e+07
Sony        2.108092e+08
Toshiba     1.519276e+08

## Aufgabe 2: 
### Pivot Analyse (OLAP Operationen in MS Excel)

> Nutze die Pivottabellenfunktion von Excel, um die oben bereits ausgeführten OLAP-Analysen zu erzeugen. Für jede Frage soll eine Ergebnistabelle erstellt werden. Erstelle dazu jeweils ein neues Excel-Tabellenblatt, welches die Pivot-Tabelle enthält, die zur Beantwortung der Frage aus der folgenden Liste benötigt wird. Binde zusätzlich in dieses Jupyter Notebook einen Screenshot der jeweiligen Tabelle ein.

> 0. Wie hoch ist der Ist- und Soll Umsatz in jedem Land insgesamt? Ordne die Ansicht nach der Landeswährung. (das hatten wir bereits in Übungsblatt 1 und wurde hier noch mal aufgenommen, damit ihr seht, wie ein Screenshot eingebunden wird)
> 1. Wie viel Gewinn haben die Filialen in Deutschland im Monat März gemacht? 
> 2. Welche Produktkategorien haben in welchen Ländern einen Verlust (negativer Gewinn) eingebracht?
> 3. Deine eigene OLAP-Analyse oder meine Vorgabe

### Beispiel
![Beispiel](screenshots/Aufgabe2-0.jpg)

### Aufgabe 2.1
INSERT SCREENSHOT HERE

### Aufgabe 2.2
INSERT SCREENSHOT HERE

### Aufgabe 2.3
**Eure eigene Fragestellung oder mein Vorschlag ("Von welchen Herstellern wurde insgesamt wie viel umgesetzt?")**

INSERT SCREENSHOT HERE

# WICHTIG!
### Bitte reicht auch die Excel-Datei ein, die die einzelnen Pivot Tabellen auf jeweils einem Excel Tabellenblatt beinhaltet
#### Name der abgebenen Exceldatei, die die Pivot Tabellen beinhaltet: 

`ÜB2_Lösung_Studierendenname.xlsx`

# Aufgabe 3
**Pivot Tabellen von oben (Excel) in Python via Pandas umsetzen**

> Lade die Tabelle `Aufgabe1_daten.csv` in ein Pandas DataFrame und führe die in Excel ausgeführten OLAP Funktionen analog in Python aus.

In [4]:
df_PCPowerMarkt = pd.read_csv("data/Aufgabe1_daten.csv", sep=";", decimal=",", index_col=0, 
                             dtype={
                                'Umsatz Ist': 'float32',
                                'Umsatz Soll': 'float32',
                                'Preis Pro Einheit': 'float32',
                                'Waehrung': 'string',
                                'Kurztext': 'string',
                                'Langtext': "string",
                                'Produktkategorie': 'string',
                                'Hersteller': 'string',
                                'Produktkategorie': 'string',
                                'Produktkategorie': 'string',
                                'Einheit': 'string',
                                'Filiale-Bez': 'string',
                                'Verkaufsleiter': 'string',
                                'Anschrift': 'string',
                                'Filiale-PLZ': 'string',
                                'Filiale-Ort': 'string',                               
                                'Region': 'string',
                                'Region-Bez': 'string',
                                'Land': 'string',
                                'LandBez': 'string',
                                'Bezeichnung': 'string',
                                'Medienart': 'string',
                                'Verantwortlicher': 'string',
                                'KalMonatJahr': 'string',
                                'Monat': 'string',
                             })

## Beispiel

In [5]:
df_pivot_beispiel = pd.pivot_table(df_PCPowerMarkt, values=['Umsatz Ist', 'Umsatz Soll'], index=['Waehrung', 'LandBez'], aggfunc=np.sum)
display(df_pivot_beispiel)

                          Umsatz Ist  Umsatz Soll
Waehrung LandBez
CAD      Kanada           62781968.0   63277852.0
CHF      Schweiz          39048976.0   38695908.0
DKK      Dänemark        325200992.0  328575328.0
EUR      Belgien          20394028.0   20565188.0
         Deutschland     265841024.0  266301152.0
         Finnland         23106586.0   23077226.0
         Frankreich       21821336.0   21910184.0
         Irland           12813939.0   12912657.0
         Italien          18228290.0   18206736.0
         Spanien          30676048.0   30399152.0
         Österreich       35221092.0   35442796.0
GBP      Großbritannien   11301620.0   11341017.0
NOK      Norwegen         47821760.0   47554196.0
PLN      Polen            85469352.0   85670744.0
SEK      Schweden         98238072.0   97905560.0
USD      USA              28862592.0   28653558.0

### Aufgabe 3.1

In [6]:
# INSERT CODE HERE

                                                                Gewinn
LandBez     Filiale-Bez                              Monat
Deutschland Global Computer Suppliers-Berlin         März   1226575.56
            Global Computer Suppliers-Frankfurt a.M. März   1340588.80
            Global Computer Suppliers-München        März   1421986.22
            Global Computer Suppliers-Stuttgart      März   1637243.83

### Aufgabe 3.2

In [16]:
# INSERT CODE HERE

                                    Gewinn
LandBez        Produktkategorie
Großbritannien Tablet            -39642.25
               Tablet PC        -651972.42

### Aufgabe 3.3

In [17]:
# INSERT CODE HERE

             Umsatz Ist
Hersteller
Acer        141737200.0
Apple       225456928.0
Casio        11051993.0
Compaq      163317760.0
HP          137846400.0
IBM          84680528.0
Sony        210809232.0
Toshiba     151927616.0